{
    "header": {
        "HOME": "INICIO",
        "ABOUT ME": "SOBRE MI",
        "SERVICES": "SERVICIOS",
        "PROJECTS": "PROYECTOS",
        "CONTACTS": "CONTACTOS"
    },
    "home": {
        "title": "Hola, <br/>Mi nombre es <br/> Igor Andrade!",
        "subtitle": "Soy un desarrollador fullstack que vive en Portugal."
    },
    "about": {
        "title": "Sobre mi",
        "text": ["Hola, soy Igor de Carvalho Andrade, un amante de la tecnología brasileño, nacido en Nova Iguaçu-RJ en 2001. Actualmente, con 21 años, vivo en Portugal, donde trabajo como desarrollador Fullstack, enfocando mi pasión y experiencia. en la creación de entornos de soluciones utilizando la tecnología React.", "Mi viaje de programación comenzó como una búsqueda para convertir ideas en realidad digital. Con el tiempo, me sumergí en el mundo del desarrollo, perfeccionando mis habilidades tanto en el front-end como en el back-end. React se ha convertido en mi principal aliado, permitiéndome crear aplicaciones web que no solo funcionan de manera eficiente sino que también brindan experiencias interactivas y fáciles de usar", "Además de mi amor por la codificación, soy un apasionado de la música y los animales. La música para mí es una forma universal de expresión que trasciende barreras y conecta a las personas. Mi lista de reproducción es tan diversa como mis intereses en la programación. También soy amante de los animales, me maravilla la variedad de especies y la belleza de la naturaleza.", "Siempre estoy buscando desafíos que me impulsen a crecer como desarrollador y como individuo. Si buscas un profesional dedicado, que traiga consigo pasión tanto por el código como por los aspectos que enriquecen la vida, estoy dispuesto a colaborar en proyectos innovadores. ¡Conectémonos y exploremos cómo podemos crear algo increíble juntos!"]   
    },
    "services": {
        "title": "Producción de Software:",
        "subtitle": "Impulso el crecimiento de tu empresa con soluciones increíblemente personalizadas.",
        "myservices": "Mis servicios:",
        "systemdevelopment": "Desarrollo de sistemas",
        "systemdevelopmenttext": "El servicio de desarrollo de sistemas crea software personalizado para satisfacer necesidades específicas. Esto implica analizar, diseñar, codificar, probar y entregar el sistema. El objetivo es automatizar procesos, aumentar la eficiencia y resolver problemas complejos. Puede abarcar desde sistemas internos hasta aplicaciones y plataformas, garantizando la usabilidad y la seguridad.",
        "mobiledevelopment": "Desarrollo móvil",
        "mobiledevelopmenttext": "El servicio de desarrollo móvil crea aplicaciones para dispositivos móviles como teléfonos inteligentes y tabletas. Se trata de diseñar, programar, probar y lanzar la aplicación. Su propósito es facilitar tareas, proporcionar entretenimiento o resolver problemas específicos. Cubre sistemas operativos como Android e IOS, asegurando la mejor usabilidad y seguridad para los usuarios.",
        "integration": "Integraciones",
        "integrationtext": "Las integraciones del sistema conectan diferentes software para trabajar juntos en armonía. Esto implica crear conexiones, intercambiar datos y sincronizar acciones entre sistemas. El objetivo es mejorar la eficiencia, evitar la duplicidad de esfuerzos y mejorar la toma de decisiones. Puede incluir la integración entre aplicaciones internas o externas, lo que garantiza un flujo de información fluido y uniforme hacia su aplicación.",
        "developmentcicle": "Ciclo de desarrollo de aplicaciones:",
        "blueprint": "Blueprint",
        "blueprinttext": "En esta etapa, delineamos la hoja de ruta completa de su proyecto, definiendo cada funcionalidad y aspecto del software. Mi enfoque es comprender sus necesidades para garantizar que el resultado final cumpla con todos los objetivos establecidos. Apoyándonos en mi experiencia técnica, transformamos ideas en planes concretos, asegurando transparencia, eficiencia y alineación con sus expectativas. En esta fase, construirá una base sólida para crear un software personalizado que impulsará sus objetivos comerciales.",
        "development": "Desarrollo",
        "developmenttext": "Maximice el potencial de su proyecto a través de la fase de desarrollo. Convierto los planes en realidad mediante la codificación y creación de software personalizado que satisfará sus demandas específicas. Con un enfoque ágil, garantizo la entrega a tiempo de características de alta calidad. Durante esta fase, estará involucrado en la retroalimentación continua, asegurándose de que el producto final sea exactamente lo que desea.",
        "support": "Soporte y mantenimiento",
        "supporttext": "Tras una implementación exitosa, me comprometeré a garantizar que su software continúe funcionando. Puedo resolver cualquier problema y hacer actualizaciones según sea necesario. Esto significa que puede concentrarse en su negocio mientras yo me ocupo de la salud y el rendimiento del software. Con soporte proactivo, tendrá la tranquilidad de saber que su inversión está protegida y evoluciona junto con sus necesidades en constante cambio."
    },
    "projects": {
        "title": "Mis proyectos",
        "subtitle": "En esta página están mis <b>4</b> proyectos principales que he ido desarrollando durante mi trayectoria como desarrollador.",
        "vlinsresume": "Proyecto realizado para una reconocida esteticista de Río de Janeiro.",
        "habitresume": "Proyecto realizado para registrar hábitos diarios.",
        "pokedevresume": "Proyecto que se desarrolla como un desafío entre amigos.",
        "blissresume": "Proyecto realizado para el proceso de selección de una empresa."
    } 
}