{
    "header": {
        "HOME": "PAGE D'ACCUEIL",
        "ABOUT ME": "À PROPOS DE MOI",
        "SERVICES": "SERVICE",
        "PROJECTS": "PROJETS",
        "CONTACTS": "CONTRATS"
    },
    "home": {
        "title": "Salut, <br/> Je m'appelle <br/> Igor Andrade!",
        "subtitle": "Je suis un développeur fullstack vivant au Portugal."
    },
    "about": {
        "title": "À propos de moi",
        "text": ["Bonjour, je suis Igor de Carvalho Andrade, un brésilien passionné de la technologie, né à Nova Iguaçu-RJ en 2001. Actuellement, à l'âge de 21 ans, je vis au Portugal, où je travaille en tant que développeur Fullstack, concentrant ma passion et mon expertise sur la création d'environnements de solutions à l'aide de la technologie React.", "Mon parcours de programmation a commencé comme une quête pour transformer des idées en réalité numérique. Au fil du temps, je me suis immergé dans le monde du développement, perfectionnant mes compétences à la fois sur le front-end et le back-end. React est devenu mon principal allié, me permettant de créer des applications Web qui non seulement fonctionnent efficacement, mais offrent également des expériences conviviales et interactives.", "En plus de mon amour du codage, je suis passionné par la musique et les animaux. La musique est pour moi une forme d'expression universelle qui transcende les barrières et relie les gens. Ma liste de lecture est aussi diversifiée que mes intérêts en matière de programmation. Je suis aussi  un amoureux des animaux, émerveillée par la variété des espèces et la beauté de la nature.", "Je suis toujours à la recherche de défis qui me poussent à grandir en tant que développeur et en tant qu'individu. Si vous recherchez un professionnel dévoué, qui apporte avec lui une passion à la fois pour le code et les aspects qui enrichissent la vie, je suis prêt à collaborer sur des projets innovants. Connectons-nous et explorons comment nous pouvons créer quelque chose d'incroyable ensemble!"]
    },
    "services": {
        "title": "Production de Logiciels:",
        "subtitle": "Je booste la croissance de votre entreprise avec des solutions incroyablement personnalisées.",
        "myservices": "Mes services:",
        "systemdevelopment": "Développement de systèmes",
        "systemdevelopmenttext": "Le service de développement de systèmes crée des logiciels personnalisés pour répondre à des besoins spécifiques. Cela implique d'analyser, de concevoir, de coder, de tester et de livrer le système. L'objectif est d'automatiser les processus, d'augmenter l'efficacité et de résoudre des problèmes complexes. Cela peut aller des systèmes internes aux applications et plates-formes, garantissant la convivialité et la sécurité.",
        "mobiledevelopment": "Développement mobile",
        "mobiledevelopmenttext": "Le service de développement mobile crée des applications pour les appareils mobiles tels que les smartphones et les tablettes. Il s'agit de concevoir, programmer, tester et lancer l'application. Son but est de faciliter des tâches, de divertir ou de résoudre des problèmes spécifiques. Il couvre les systèmes d'exploitation tels qu'Android et IOS, garantissant la meilleure convivialité et sécurité pour les utilisateurs.",
        "integration": "Intégrations",
        "integrationtext": "Les intégrations système connectent différents logiciels pour qu'ils fonctionnent ensemble harmonieusement. Cela implique de créer des connexions, d'échanger des données et de synchroniser des actions entre les systèmes. L'objectif est d'améliorer l'efficacité, d'éviter la duplication des efforts et d'améliorer la prise de décision. Il peut inclure l'intégration entre des applications internes ou externes, garantissant un flux d'informations fluide et cohérent vers votre application.",
        "developmentcicle": "Cycle de développement d'applications:",
        "blueprint": "Blueprint",
        "blueprinttext": "A ce stade, nous décrivons la feuille de route complète de votre projet, définissant chaque fonctionnalité et aspect du logiciel. Mon objectif est de comprendre vos besoins afin de garantir que le résultat final réponde à tous les objectifs établis. S'appuyant sur mon expertise technique, nous transformons les idées en plans concrets, assurant transparence, efficacité et alignement avec vos attentes. Au cours de cette phase, vous construirez une base solide pour créer un logiciel sur mesure qui conduira à vos objectifs commerciaux.",
        "development": "Développement",
        "developmenttext": "Maximisez le potentiel de votre projet tout au long de la phase de développement. Je transforme les plans en réalité en codant et en créant un logiciel personnalisé qui répondra à vos demandes spécifiques. Avec une approche agile, j'assure la livraison à temps de fonctionnalités de haute qualité. Au cours de cette phase, vous serez impliqué pour un retour d'information continu, garantissant que le produit final correspond exactement à ce que vous souhaitez.",
        "support": "Assistance et entretien",
        "supporttext": "Une fois la mise en œuvre réussie, je m'engagerai à garantir que votre logiciel continue de fonctionner. Je suis capable de résoudre tous les problèmes et de faire les mises à jour nécessaires. Cela signifie que vous pouvez vous concentrer sur votre entreprise pendant que je m'occupe de la santé et des performances du logiciel. Avec un support proactif, vous aurez l'esprit tranquille en sachant que votre investissement est protégé et évolue en même temps que vos besoins en constante évolution."
    } 
}
